<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => 'የ: ባህሪው መቀበል አለበት.',
    'accepted_if' => ': ባህሪው መቀበል ያለበት :ሌላው : እሴት ነው።',
    'active_url' => 'ባህሪው ትክክለኛ ዩአርኤል አይደለም።',
    'after' => 'ባህሪው ከ: ቀን በኋላ ያለ ቀን መሆን አለበት.',
    'after_or_equal' => 'ባህሪው ከ: ቀን በኋላ ያለ ወይም እኩል የሆነ ቀን መሆን አለበት።',
    'alpha' => 'ባህሪው ፊደላትን ብቻ መያዝ አለበት።',
    'alpha_dash' => 'ባህሪው ፊደሎችን፣ ቁጥሮችን፣ ሰረዞችን እና የግርጌ ማስታወሻዎችን ብቻ መያዝ አለበት።',
    'alpha_num' => 'ባህሪው ፊደሎችን እና ቁጥሮችን ብቻ መያዝ አለበት።',
    'array' => 'ባህሪው ድርድር መሆን አለበት።',
    'before' => 'ባህሪው ከ: ቀን በፊት ያለ ቀን መሆን አለበት።',
    'before_or_equal' => 'ባህሪው ከ: ቀን በፊት ወይም እኩል የሆነ ቀን መሆን አለበት.',
    'between' => [
        'array' => 'የ: ባህሪው በ: ደቂቃ እና በ: ከፍተኛ እቃዎች መካከል ሊኖረው ይገባል.',
        'file' => 'የ: ባህሪው በ: ደቂቃ እና በ: ከፍተኛ ኪሎባይት መካከል መሆን አለበት።',
        'numeric' => 'ባህሪው በ:ደቂቃ እና :ከፍተኛ መካከል መሆን አለበት።',
        'string' => 'የ: ባህሪው በ: ደቂቃ እና በ: ከፍተኛ ቁምፊዎች መካከል መሆን አለበት.',
    ],
    'boolean' => 'የ: መለያ መስክ እውነት ወይም ሐሰት መሆን አለበት።',
    'confirmed' => 'የ: ባህሪ ማረጋገጫው አይዛመድም።',
    'current_password' => 'የይለፍ ቃሉ የተሳሳተ ነው።',
    'date' => 'ባህሪው ትክክለኛ ቀን አይደለም።',
    'date_equals' => 'ባህሪው ከ: ቀን ጋር እኩል የሆነ ቀን መሆን አለበት።',
    'date_format' => 'የ: ባህሪው ከቅርጸት: ቅርጸት ጋር አይዛመድም።',
    'declined' => 'ባህሪው ውድቅ መደረግ አለበት።',
    'declined_if' => ': ባህሪው ውድቅ መደረግ ያለበት :ሌላ : እሴት ነው።',
    'different' => 'ባህሪው እና :ሌላው የተለየ መሆን አለበት።',
    'digits' => 'ባህሪው :አሃዞች መሆን አለበት።',
    'digits_between' => 'የ: ባህሪው በ: ደቂቃ እና በ: ከፍተኛ አሃዞች መካከል መሆን አለበት።',
    'dimensions' => 'የ: ባህሪው ልክ ያልሆኑ የምስል ልኬቶች አሉት።',
    'distinct' => 'የ: ባህሪ መስክ የተባዛ እሴት አለው።',
    'email' => 'ባህሪው ትክክለኛ የኢሜይል አድራሻ መሆን አለበት።',
    'ends_with' => 'ባህሪው ከሚከተሉት በአንዱ ማለቅ አለበት:: እሴቶች።',
    'enum' => 'የተመረጠው: ባህሪ ልክ ያልሆነ ነው።',
    'exists' => 'የተመረጠው: ባህሪ ልክ ያልሆነ ነው።',
    'file' => 'ባህሪው ፋይል መሆን አለበት።',
    'filled' => 'የ: ባህሪ መስክ ዋጋ ሊኖረው ይገባል።',
    'gt' => [
        'array' => 'ባህሪው ከ: እሴት በላይ ሊኖረው ይገባል።',
        'file' => 'ባህሪው ከ: እሴት ኪሎባይት በላይ መሆን አለበት።',
        'numeric' => 'ባህሪው ከ: እሴት በላይ መሆን አለበት።',
        'string' => 'ባህሪው ከ: እሴት ቁምፊዎች የበለጠ መሆን አለበት።',
    ],
    'gte' => [
        'array' => 'ባህሪው: እሴት እቃዎች ወይም ከዚያ በላይ ሊኖራቸው ይገባል.',
        'file' => 'የ: ባህሪው ከ: እሴት ኪሎባይት የበለጠ ወይም እኩል መሆን አለበት።',
        'numeric' => 'ባህሪው ከ: እሴት የበለጠ ወይም እኩል መሆን አለበት።',
        'string' => 'ባህሪው ከ: እሴት ቁምፊዎች የበለጠ ወይም እኩል መሆን አለበት።',
    ],
    'image' => 'ባህሪው ምስል መሆን አለበት።',
    'in' => 'የተመረጠው: ባህሪ ልክ ያልሆነ ነው።',
    'in_array' => 'የ:ባህሪ መስክ በ:ሌላ ውስጥ የለም።',
    'integer' => 'ባህሪው ኢንቲጀር መሆን አለበት።',
    'ip' => 'ባህሪው ትክክለኛ የአይፒ አድራሻ መሆን አለበት።',
    'ipv4' => 'ባህሪው ትክክለኛ IPv4 አድራሻ መሆን አለበት።',
    'ipv6' => 'ባህሪው ትክክለኛ IPv6 አድራሻ መሆን አለበት።',
    'json' => 'የ: ባህሪው ልክ የሆነ JSON ሕብረቁምፊ መሆን አለበት።',
    'lt' => [
        'array' => 'ባህሪው ከ: እሴት እቃዎች ያነሰ መሆን አለበት.',
        'file' => 'ባህሪው ከ: እሴት ኪሎባይት ያነሰ መሆን አለበት።',
        'numeric' => 'ባህሪው ከ: እሴት ያነሰ መሆን አለበት።',
        'string' => 'ባህሪው ከ: እሴት ቁምፊዎች ያነሰ መሆን አለበት።',
    ],
    'lte' => [
        'array' => 'ባህሪው ከ: እሴት በላይ ሊኖረው አይገባም።',
        'file' => 'የ: ባህሪው ከ: እሴት ኪሎባይት ያነሰ ወይም እኩል መሆን አለበት።',
        'numeric' => 'ባህሪው ከ: እሴት ያነሰ ወይም እኩል መሆን አለበት።',
        'string' => 'ባህሪው ከ: እሴት ቁምፊዎች ያነሰ ወይም እኩል መሆን አለበት።',
    ],
    'mac_address' => 'ባህሪው ትክክለኛ የማክ አድራሻ መሆን አለበት።',
    'max' => [
        'array' => 'ባህሪው ከ: ከፍተኛ እቃዎች ሊኖረው አይገባም።',
        'file' => 'ባህሪው ከ:ከፍተኛ ኪሎባይት መብለጥ የለበትም።',
        'numeric' => 'ባህሪው ከ: ከፍተኛ መሆን የለበትም።',
        'string' => 'ባህሪው ከ:ከፍተኛ ቁምፊዎች መብለጥ የለበትም።',
    ],
    'mimes' => 'ባህሪው የፋይል አይነት: እሴት መሆን አለበት።',
    'mimetypes' => 'ባህሪው የፋይል አይነት: እሴት መሆን አለበት።',
    'min' => [
        'array' => 'ባህሪው ቢያንስ :ደቂቃ እቃዎች ሊኖሩት ይገባል።',
        'file' => 'ባህሪው ቢያንስ :ደቂቃ ኪሎባይት መሆን አለበት።',
        'numeric' => 'ባህሪው ቢያንስ : ደቂቃ መሆን አለበት።',
        'string' => 'ባህሪው ቢያንስ :ደቂቃ ቁምፊዎች መሆን አለበት።',
    ],
    'multiple_of' => 'ባህሪው የ: እሴት ብዜት መሆን አለበት።',
    'not_in' => 'የተመረጠው: ባህሪ ልክ ያልሆነ ነው።',
    'not_regex' => 'የ: ባህሪ ቅርጸት ልክ ያልሆነ ነው።',
    'numeric' => 'ባህሪው ቁጥር መሆን አለበት።',
    'present' => 'የ: ባህሪ መስክ መገኘት አለበት.',
    'prohibited' => 'የ: ባህሪ መስክ የተከለከለ ነው።',
    'prohibited_if' => 'የ: ባህሪ መስኩ የተከለከለ ነው :ሌላ: እሴት።',
    'prohibited_unless' => ':ሌላው በ:እሴቶች ውስጥ ካልሆነ በስተቀር የ:ባህሪው መስክ የተከለከለ ነው።',
    'prohibits' => 'የ: ባህሪ መስክ :ሌላ እንዳይገኝ ይከለክላል።',
    'regex' => 'የ: ባህሪ ቅርጸት ልክ ያልሆነ ነው።',
    'required' => 'የ: ባህሪ መስክ ያስፈልጋል።',
    'required_array_keys' => 'የ: ባህሪ መስክ ለ: እሴቶች ግቤቶችን መያዝ አለበት.',
    'required_if' => 'የ : ባህሪ መስክ ያስፈልጋል :ሌላ : እሴት ነው።',
    'required_unless' => 'ሌላ በ:እሴቶች ውስጥ ካልሆነ በስተቀር የ:ባህሪው መስክ ያስፈልጋል።',
    'required_with' => 'የ: ባህሪ መስክ ያስፈልጋል: እሴቶች ሲኖሩ።',
    'required_with_all' => 'የ:ባህሪ መስክ ያስፈልጋል:እሴቶች በሚገኙበት ጊዜ።',
    'required_without' => 'የ: ባህሪ መስክ ያስፈልጋል: እሴቶች በማይኖሩበት ጊዜ.',
    'required_without_all' => 'ከ:እሴቶች አንዳቸውም በማይገኙበት ጊዜ የ:ባህሪ መስክ ያስፈልጋል።',
    'same' => 'ባህሪው እና :ሌላው መመሳሰል አለባቸው።',
    'size' => [
        'array' => 'ባህሪው :መጠን ያላቸውን እቃዎች መያዝ አለበት።',
        'file' => 'ባህሪው:መጠን ኪሎባይት መሆን አለበት።',
        'numeric' => 'ባህሪው :መጠን መሆን አለበት።',
        'string' => 'ባህሪው:መጠን ቁምፊዎች መሆን አለበት።',
    ],
    'starts_with' => 'ባህሪው ከሚከተሉት ውስጥ በአንዱ መጀመር አለበት:: እሴቶች።',
    'string' => 'የ: ባህሪው ሕብረቁምፊ መሆን አለበት።',
    'timezone' => 'ባህሪው ትክክለኛ የሰዓት ሰቅ መሆን አለበት።',
    'unique' => 'ባህሪው አስቀድሞ ተወስዷል።',
    'uploaded' => 'የ: ባህሪው መጫን አልቻለም።',
    'url' => 'ባህሪው ትክክለኛ ዩአርኤል መሆን አለበት።',
    'uuid' => 'ባህሪው ትክክለኛ UUID መሆን አለበት።',
    'password' => [
        'mixed' => 'ባህሪው ቢያንስ አንድ አቢይ ሆሄ እና አንድ ትንሽ ሆሄ መያዝ አለበት።',
        'letters' => 'ባህሪው ቢያንስ አንድ ፊደል መያዝ አለበት።',
        'numbers' => 'ባህሪው ቢያንስ አንድ ቁጥር መያዝ አለበት።',
        'symbols' => 'ባህሪው ቢያንስ አንድ ልዩ ቁምፊ መያዝ አለበት።',
        'uncompromised' => 'የተሰጠው፡ ባህሪ በውሂብ መፍሰስ ውስጥ ታይቷል። እባክዎን የተለየ ባህሪ ይምረጡ።',
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'ብጁ መልእክት',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];
